# PointCollection Properties

---
The PointCollection type exposes the following members.
| Name| Description
---|---|---
| Count|  The number of points in this collection.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace